zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_OCCS.h
#define OCCS_PROT_FRQEP_MASK                     (0x30U)
#define OCCS_PROT_FRQEP_SHIFT                    (4U)
/*! FRQEP - Frequency Enable Protection
 *  0b00..Write protection off (default).
 *  0b01..Write protection on.
 *  0b10..Write protection off and locked until chip reset.
 *  0b11..Write protection on and locked until chip reset.
 */
#define OCCS_PROT_FRQEP(x)                       (((uint16_t)(((uint16_t)(x)) << OCCS_PROT_FRQEP_SHIFT)) & OCCS_PROT_FRQEP_MASK)
/*! @} */

/*! @name OSCTL3 - Oscillator Control Register 3 */
/*! @{ */

#define OCCS_OSCTL3_FREQ_TRIM8M_MASK             (0x7FU)
#define OCCS_OSCTL3_FREQ_TRIM8M_SHIFT            (0U)
/*! FREQ_TRIM8M - Internal RC Oscillator 8MHz clock Trim Code */
#define OCCS_OSCTL3_FREQ_TRIM8M(x)               (((uint16_t)(((uint16_t)(x)) << OCCS_OSCTL3_FREQ_TRIM8M_SHIFT)) & OCCS_OSCTL3_FREQ_TRIM8M_MASK)

#define OCCS_OSCTL3_TRIM8M_RNG_MASK              (0x300U)
#define OCCS_OSCTL3_TRIM8M_RNG_SHIFT             (8U)
/*! TRIM8M_RNG - Internal RC Oscillator 8MHz clock Trim Range Enlarge */
#define OCCS_OSCTL3_TRIM8M_RNG(x)                (((uint16_t)(((uint16_t)(x)) << OCCS_OSCTL3_TRIM8M_RNG_SHIFT)) & OCCS_OSCTL3_TRIM8M_RNG_MASK)
/*! @} */

/*! @name OSCTL4 - Oscillator Control Register 4 */
/*! @{ */

#define OCCS_OSCTL4_FREQ_TRIM2M_MASK             (0x7FU)
#define OCCS_OSCTL4_FREQ_TRIM2M_SHIFT            (0U)
/*! FREQ_TRIM2M - Internal RC Oscillator 2MHz clock Trim Code */
#define OCCS_OSCTL4_FREQ_TRIM2M(x)               (((uint16_t)(((uint16_t)(x)) << OCCS_OSCTL4_FREQ_TRIM2M_SHIFT)) & OCCS_OSCTL4_FREQ_TRIM2M_MASK)

#define OCCS_OSCTL4_TRIM2M_RNG_MASK              (0x300U)
#define OCCS_OSCTL4_TRIM2M_RNG_SHIFT             (8U)
/*! TRIM2M_RNG - Internal RC Oscillator 2MHz clock Trim Range Enlarge */
#define OCCS_OSCTL4_TRIM2M_RNG(x)                (((uint16_t)(((uint16_t)(x)) << OCCS_OSCTL4_TRIM2M_RNG_SHIFT)) & OCCS_OSCTL4_TRIM2M_RNG_MASK)
/*! @} */

/*! @name IRC8M_MON_THR_HI - IRC8M High Threshold */
/*! @{ */

#define OCCS_IRC8M_MON_THR_HI_IRC8M_MON_THR_HI_MASK (0x1FFU)
#define OCCS_IRC8M_MON_THR_HI_IRC8M_MON_THR_HI_SHIFT (0U)
/*! IRC8M_MON_THR_HI - IRC8M Monitor High Threshold */
#define OCCS_IRC8M_MON_THR_HI_IRC8M_MON_THR_HI(x) (((uint16_t)(((uint16_t)(x)) << OCCS_IRC8M_MON_THR_HI_IRC8M_MON_THR_HI_SHIFT)) & OCCS_IRC8M_MON_THR_HI_IRC8M_MON_THR_HI_MASK)
/*! @} */

/*! @name IRC8M_MON_THR_LO - IRC8M Low Threshold */
/*! @{ */

#define OCCS_IRC8M_MON_THR_LO_IRC8M_MON_THR_LO_MASK (0x1FFU)
#define OCCS_IRC8M_MON_THR_LO_IRC8M_MON_THR_LO_SHIFT (0U)
/*! IRC8M_MON_THR_LO - IRC8M Monitor Low Threshold */
#define OCCS_IRC8M_MON_THR_LO_IRC8M_MON_THR_LO(x) (((uint16_t)(((uint16_t)(x)) << OCCS_IRC8M_MON_THR_LO_IRC8M_MON_THR_LO_SHIFT)) & OCCS_IRC8M_MON_THR_LO_IRC8M_MON_THR_LO_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group OCCS_Register_Masks */


/*!
 * @}
 */ /* end of group OCCS_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_OCCS_H_ */

